Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseNumericConstantFilterExpression(System.String,System.IFormatProvider)
Parses a string returning a new Tekla.Structures.Filtering.NumericConstantFilterExpression.
Override this method to change the class behavior.
NumericConstantString: The input string to parse.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.NumericConstantFilterExpression.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseDateTimeConstantFilterExpression(System.String,System.IFormatProvider)
Parses a string returning a new Tekla.Structures.Filtering.DateTimeConstantFilterExpression.
Override this method to change the class behavior.
DateTimeConstantString:
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.DateTimeConstantFilterExpression.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.